misc/EchoRequest.xml

<SOAP-ENV:Envelope
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" SOAP-ENV:mustUnderstand="1">
			<wsse:UsernameToken wsu:Id="UsernameToken-936f8908-549e-410a-a754-200db7d09528">
				<wsse:Username>xyz</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">at/DttHlOo9KRkecQqpSRrI0i5w=</wsse:Password>
				<wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">tj/O7JBMsoA++zMX8bnbbw==</wsse:Nonce>
				<wsu:Created>2025-06-11T16:57:41.768Z</wsu:Created>
			</wsse:UsernameToken>
			<wsu:Timestamp wsu:Id="TS-68b52aed-d652-466e-ae3a-d6154651775e">
				<wsu:Created>2025-06-11T16:57:41.753Z</wsu:Created>
				<wsu:Expires>2025-06-11T17:02:41.753Z</wsu:Expires>
			</wsu:Timestamp>
		</wsse:Security>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<ns2:EudrEchoRequest
			xmlns:ns2="http://ec.europa.eu/tracesnt/eudr/echo">
			<ns2:query>Hallo EUDR Echo Service!</ns2:query>
		</ns2:EudrEchoRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>